{
  "main": {
    "name": "Emna FERCHICHI",
    "occupation": "ISTQB Certified Tester Foundation Level V4.0",
    "image": "Emna_Pic.png",
    "bio": "Hi there! I’m Emna, a QA Engineer with a strong development background. With over three years of experience in software testing and development, I’ve worked with both startups and large corporations to ensure high-quality software through automation, functional testing, and CI/CD integration. My expertise spans across tools like Selenium, Cypress, Postman, and Jenkins, as well as development frameworks like .NET Core, Angular, and Spring Boot.Throughout my journey, I discovered my passion for building robust testing strategies while also creating efficient and scalable applications. I thrive on solving complex problems, collaborating with cross-functional teams, and continuously learning new technologies. Whether it's refining test automation pipelines or developing innovative solutions, I love bridging the gap between QA and development to deliver top-tier software.Let’s connect and build something great together!",
    "contactmessage": "Get in touch with me",
    "email": "ferchichi.emna.dev@gmail.com",
    "phone": "+216 51170554",
    "address": {
      "street": "Tunis",
      "state": "Tunisia"
    },
    "website": "",
    "resumedownload": "",
    "social": [
      
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/emna-ferchichi-971078241/",
        "className": "fa fa-linkedin"
      },
      
      {
        "name": "github",
        "url": "https://github.com/EmnaFerchichi",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "Universiry": "ESPRIT: Private Higher School of Engineering and Technologies",
        "degree": "Software Engineering",
        "graduated": "September, 2024",
        "description": "Graduated with First Class Honours"
      },
      {
        "Universiry": "ISI: Higher Institute of Computer Science",
        "degree": "Bachelor, Embedded Systems",
        "graduated": "September, 2021",
        "description": "Graduated with Honours"
      }
    ],
    "work": [
      {
        "company": "Gust Training",
        "title": "Software QA Engineer",
        "years": " December,2024 - Present",
        "description": "responsible for ensuring the quality of software products through rigorous testing processes. You manage and track test cases, report issues, and verify that the application meets functional and performance standards. You contribute to both manual and automated testing efforts, executing test scenarios to identify bugs and ensuring the proper functionality of the system."
      },
      {
        "company": "Société Générale",
        "title": "Full Stack Web Developer",
        "years": " March,2024 - September,2024",
        "description": "I worked on a web application simulating Excel reports for traders, focusing on interest rate curves, Cross-Currency, and financial repos analysis. My responsibilities included developing RESTful APIs, building user interfaces, and implementing real-time data retrieval for financial analysis. I also handled the generation and download of real-time financial curves and managed databases using MongoDB. I tracked bugs with JIRA and integrated automated tests into CI/CD pipelines with Jenkins. Additionally, I wrote unit tests with NUnit to ensure functionality and collaborated closely with trading teams to meet their requirements and ensure the application's effectiveness in real-world scenarios."
      },
      {
        "company": "CliniSys",
        "title": "QA Tester",
        "years": " Februray,2023 - August,2023",
        "description": "I worked on a web application for medical appointment scheduling, where I designed and executed test cases, improving test coverage by 80%. I performed regression testing at the end of each sprint, reducing bug reintroduction by 75%. I tracked and analyzed anomalies, collaborating with Product, Development, and QA teams to resolve issues. I also implemented automated regression tests, reducing testing time by 70%, and created bug reports and functional documentation, ensuring the application’s quality and stability."
      },
      {
        "company": "Tritux",
        "title": "Embedded System Internship",
        "years": " February,2021 - September 2021",
        "description": "I worked on the development of a smart meter, focusing on designing and implementing features to enhance its functionality and efficiency."
      },
      {
        "company": "Capgemini",
        "title": "QA Tester",
        "years": " March,2020 - September,2020",
        "description": "I worked on automating Synergy deliverables, where I designed and implemented automated tests for RESTful APIs and used Selenium for UI testing. I developed automated test scripts with JUnit and TestNG, and configured and managed test environments with Vagrant. I integrated automated tests into the CI/CD pipeline, monitored and analyzed test performance using Prometheus/Grafana, and managed automated regression tests. I also executed and analyzed unit and integration tests, and documented the results through comprehensive test reports."
      }
    ],
    "skills": [
      {
        "name": "-Méthodes : Agile Scrum"
      },
      {
        "name": "-Base de données: SQL : SQL Server, MySQL , NoSQL : MongoDB"
      },
      {
        "name": "-Langages: JavaScript, Java, C# , Python"
      },
      {
        "name": "-Frameworks : ASP.Net MVC, .Net Core, Angular, Bootstrap"
      },
      {
        "name": "-Automation Frameworks & Tools: Selenium, Cypress, Postman, Git, Jenkins, Vagrant, Maven, SonarQube,Nexus, Prometheus/Grafana, DockerHub, JUnit, NUnit"
      },
      {
        "name": "-Outils de développement: Visual Studio – Visual Code"
      },
      {
        "name": "-Manual Testing Tools: Jira,Xray,TestLink,SquashTM"
      },
      {
        "name": "-Méthodologies de tests: Functional Testing, Non-Functional"
      },
      {
        "name": "-Outils de bureautique: Office, word, Excel, PowerPoint"
      }
    ]
  },
  
  "testimonials": {
    "testimonials": [
      {
        "text": "Emna is absolutely excellent, her depth of knowledge & his mentorship really meant a lot to us... I would definitely recommend",
        "user": "Ali BENBRAHIM - R&D Manager"
      },
      {
        "text": "Emna is very punctual and always follows work schedules. She quickly became part of the team by getting along well with her colleagues and communicating effectively. Her dedication and hard work are appreciated, showing her willingness to learn and complete her tasks well. Her evaluation highlights her positive attitude, reliability, and ability to adapt, making her a great team member.",
        "user": "Amine HAJJI - Project Manager"
      }
    ]
  }
}
